Revit 2027 API
Document.GetDocumentPreviewSettings Method
 Returns the preview settings for the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DocumentPreviewSettings GetDocumentPreviewSettings()
Public Function GetDocumentPreviewSettings As DocumentPreviewSettings
public:
DocumentPreviewSettings^ GetDocumentPreviewSettings()
member GetDocumentPreviewSettings : unit -> DocumentPreviewSettings
Return Value
DocumentPreviewSettings
 The preview settings.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace